app/controllers/admin/roles_controller.rb

  def create
    @admin_role = Admin::Role.new(admin_role_params)

    respond_to do |format|
      if @admin_role.save
---
INSERT INTO `admin_roles` (`created_at`, `name`, `updated_at`) VALUES ('2014-07-26 19:52:12', 'User', '2014-07-26 19:52:12')