app/views/users/_user.html.erb

<td>
  <%= user.admin_roles.map {|c| c.name}.join(', ') %>
---
SELECT `admin_roles`.* FROM `admin_roles` INNER JOIN `admin_roles_users` ON `admin_roles`.`id` = `admin_roles_users`.`role_id` WHERE `admin_roles_users`.`user_id` = 1