app/controllers/users_controller.rb

  def view_locked
    @users = User.where.not(locked_at: nil)
---
SELECT `users`.* FROM `users`  WHERE (`users`.`locked_at` IS NOT NULL)

  def create
    @user = User.new(secure_params)
    authorize @user
    @back = request.env["HTTP_REFERER"]
    @here = request.env["REQUEST_URI"]
    if @user.save
---
INSERT INTO `users` (`created_at`, `email`, `encrypted_password`, `failed_attempts`, `name`, `role`, `updated_at`, `username`) VALUES ('2014-07-26 15:26:21', 'goriverna@gmail.com', '$2a$10$qbSxgmBcxVDACgeuQZqXVueKDN.RvvUX4SUqv3eCblZHz0RjTQ.ye', 0, 'Marco Vernaccini', 0, '2014-07-26 15:26:21', 'm.vernaccini')

  def show
    @user = User.find_by_id(params[:id])
---
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1

  def edit
    @user = User.find_by_id(params[:id])
---
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1

  def update
    @user = User.find_by_id(params[:id])
    authorize @user
    if current_user.admin?
      params[:user].delete(:current_password)
      if params[:user][:password].blank?
        params[:user].delete(:password)
        params[:user].delete(:password_confirmation)
      end
      if params[:user][:locked_at] == 'LockNOW'
        params[:user][:locked_at] = Time.now
        params[:user][:failed_attempts] = 5
      elsif params[:user][:locked_at].blank?
        params[:user][:failed_attempts] = 0
      end
      if @user.update_without_password(secure_params)
---
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `encrypted_password` = '$2a$10$ZitOnS8dmDpeWukbk1zPHeWqwp4zqnMX/c12HFJ36rVvQyoT9Ejxm', `name` = 'Dir. Sup. Giuseppe Vadalà', `updated_at` = '2014-07-25 14:11:44' WHERE `users`.`id` = 4